{
  "_name_or_path": "CAMeL-Lab/bert-base-arabic-camelbert-da",
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "B-DATE",
    "1": "I-AFFT",
    "2": "B-MONTH",
    "3": "B-GOV",
    "4": "B-NUM",
    "5": "B-DAY",
    "6": "I-MIN",
    "7": "I-KEY",
    "8": "I-INC",
    "9": "I-INT",
    "10": "B-KEY",
    "11": "B-OUT",
    "12": "B-AFFT",
    "13": "I-DEPT",
    "14": "I-MONTH",
    "15": "I-DEC",
    "16": "B-INT",
    "17": "DEC",
    "18": "I-OUT",
    "19": "B-PERIOD",
    "20": "B-MIN",
    "21": "O",
    "22": "B-DEPT",
    "23": "B-INC",
    "24": "I-GOV",
    "25": "B-DEC",
    "26": "B-YEAR",
    "27": "I-PERIOD"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-AFFT": 12,
    "B-DATE": 0,
    "B-DAY": 5,
    "B-DEC": 25,
    "B-DEPT": 22,
    "B-GOV": 3,
    "B-INC": 23,
    "B-INT": 16,
    "B-KEY": 10,
    "B-MIN": 20,
    "B-MONTH": 2,
    "B-NUM": 4,
    "B-OUT": 11,
    "B-PERIOD": 19,
    "B-YEAR": 26,
    "DEC": 17,
    "I-AFFT": 1,
    "I-DEC": 15,
    "I-DEPT": 13,
    "I-GOV": 24,
    "I-INC": 8,
    "I-INT": 9,
    "I-KEY": 7,
    "I-MIN": 6,
    "I-MONTH": 14,
    "I-OUT": 18,
    "I-PERIOD": 27,
    "O": 21
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.47.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30000
}
